

<center>
    <b>
<span style="font-size: 32pt; line-height:1.2"> 
COMS W4111-002 (Spring 2022)<br>Lecture 4 Material
</span>
        </b>
    </center>
<br>
<br>
<br>

# Setup

In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://dbuser:dbuserdbuser@localhost

'Connected: dbuser@None'

## NULLs

- Consider some simple scenario. Basic information about people.

In [3]:
%sql create schema if not exists aaaaaaS22W4111Examples;

 * mysql+pymysql://dbuser:***@localhost
1 rows affected.

[]

In [4]:
%%sql

drop table if exists `aaaaaaS22W4111Examples`.`simple_person_info`;

CREATE TABLE `aaaaaaS22W4111Examples`.`simple_person_info` (
  `uni` VARCHAR(16) NOT NULL,
  `age_in_years` INT NULL,
  `grade_point_average` FLOAT NULL,
  PRIMARY KEY (`uni`));

select 1;

 * mysql+pymysql://dbuser:***@localhost
0 rows affected.
0 rows affected.
1 rows affected.

[(1,)]

- What was the weird ```select 1;```?


- You may get very scary warning messages of the form/similar to:<br><br>

```
sqlalchemy.exc.ResourceClosedError: This result object does not return rows. It has been closed automatically.
```

- This is not really an error. You can fix this by:
    - Changing your version of SQLAlchemy.
    - Simply adding ```select 1;``` and using the cell magic ```%%sql```.
    
    
- Changing SQLAlchemy versions may have side effects on other packages.


- What is my version?

In [ ]:
import sqlalchemy

In [ ]:
 sqlalchemy.__version__

- For a "simple person," 
    - We may have incomplete information and not know the person's age.
    - May the person is not a student and GPA is "not applicable."
    
    
- The columns are integers. So, we cannot use something like ```''``` or ```'NA'```.


- Well, let's pick ```-1.``` That is clearly invalid. But, ... ...

In [5]:
%%sql

use aaaaaaS22W4111Examples;

insert into simple_person_info(uni, age_in_years, grade_point_average)
    values
        ("dff9", 100, 3.0),
        ("yy5", -1, 4.0),
        ('xyz123', 50, -1)

 * mysql+pymysql://dbuser:***@localhost
0 rows affected.
3 rows affected.

[]

In [6]:
%sql select * from simple_person_info;

 * mysql+pymysql://dbuser:***@localhost
3 rows affected.

[('dff9', 100, 3.0), ('xyz123', 50, -1.0), ('yy5', -1, 4.0)]

- We will see later in the lecture that there are "aggregate" functions.

In [7]:
%sql select avg(age_in_years), sum(grade_point_average) from simple_person_info;

 * mysql+pymysql://dbuser:***@localhost
1 rows affected.

[(Decimal('49.6667'), 6.0)]

- I do not know what the correct answer is but I know it is not that.


- One of the things NULL fixes are problems like this one.

In [8]:
%%sql

update simple_person_info
    set age_in_years = if(age_in_years=-1,NULL,age_in_years),
        grade_point_average = if(grade_point_average=-1,NULL,grade_point_average)

 * mysql+pymysql://dbuser:***@localhost
3 rows affected.

[]

In [9]:
%sql select * from simple_person_info;

 * mysql+pymysql://dbuser:***@localhost
3 rows affected.

[('dff9', 100, 3.0), ('xyz123', 50, None), ('yy5', None, 4.0)]

- ```None``` is how ```NULL``` gets represented into Python.

In [10]:
%sql select avg(age_in_years), sum(grade_point_average) from simple_person_info;

 * mysql+pymysql://dbuser:***@localhost
1 rows affected.

[(Decimal('75.0000'), 7.0)]

- That answer looks better to me.


- There are other reasons to use NULL versus arbitrary markers for "not applicable" or "unknown."

# Fun with Dates

In [11]:
#
# This is one awkward way to handle paths in an OS independent way.
#

# For explanation, this is the path to my data directory.
data_path = "/Users/donaldferguson/Dropbox/Columbia/W4111-Intro-to-DB-S22/Data/Lahmans_Baseball_DB"

In [12]:
import os.path

In [13]:
#
# Platform independent way to get "HOME"
h = os.path.expanduser("~")
h

'/Users/donaldferguson'

In [14]:
data_path = os.path.join(
    h,
    'Dropbox',
    'Columbia',
    'W4111-Intro-to-DB-S22',
    'Data',
    'Lahmans_Baseball_DB'
)

data_path

'/Users/donaldferguson/Dropbox/Columbia/W4111-Intro-to-DB-S22/Data/Lahmans_Baseball_DB'

- This should do the right thing like ```'C:\\Users\\donaldferguson\\ ...'``` on Windows.

- Let's load some basic information about People from [Lahman's Baseball Database](https://www.seanlahman.com/baseball-archive/statistics/).


- This is a zip file with a bunch of CSV files. There is an explanatory file ```README.txt```.

In [15]:
import pandas

In [16]:
people_file_path = os.path.join(data_path, 'People.csv')
people_file_path

'/Users/donaldferguson/Dropbox/Columbia/W4111-Intro-to-DB-S22/Data/Lahmans_Baseball_DB/People.csv'

In [17]:
people_df = pandas.read_csv(people_file_path)
people_df

,playerID,birthYear,birthMonth,birthDay,birthCountry,birthState,birthCity,deathYear,deathMonth,deathDay,...,nameLast,nameGiven,weight,height,bats,throws,debut,finalGame,retroID,bbrefID
0,aardsda01,1981.0,12.0,27.0,USA,CO,Denver,NaN,NaN,NaN,...,Aardsma,David Allan,215.0,75.0,R,R,2004-04-06,2015-08-23,aardd001,aardsda01
1,aaronha01,1934.0,2.0,5.0,USA,AL,Mobile,2021.0,1.0,22.0,...,Aaron,Henry Louis,180.0,72.0,R,R,1954-04-13,1976-10-03,aaroh101,aaronha01
2,aaronto01,1939.0,8.0,5.0,USA,AL,Mobile,1984.0,8.0,16.0,...,Aaron,Tommie Lee,190.0,75.0,R,R,1962-04-10,1971-09-26,aarot101,aaronto01
3,aasedo01,1954.0,9.0,8.0,USA,CA,Orange,NaN,NaN,NaN,...,Aase,Donald William,190.0,75.0,R,R,1977-07-26,1990-10-03,aased001,aasedo01
4,abadan01,1972.0,8.0,25.0,USA,FL,Palm Beach,NaN,NaN,NaN,...,Abad,Fausto Andres,184.0,73.0,L,L,2001-09-10,2006-04-13,abada001,abadan01
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
20353,zupofr01,1939.0,8.0,29.0,USA,CA,San Francisco,2005.0,3.0,25.0,...,Zupo,Frank Joseph,182.0,71.0,L,R,1957-07-01,1961-05-09,zupof101,zupofr01
20354,zuvelpa01,1958.0,10.0,31.0,USA,CA,San Mateo,NaN,NaN,NaN,...,Zuvella,Paul,173.0,72.0,R,R,1982-09-04,1991-05-02,zuvep001,zuvelpa01
20355,zuverge01,1924.0,8.0,20.0,USA,MI,Holland,2014.0,9.0,8.0,...,Zuverink,George,195.0,76.0,R,R,1951-04-21,1959-06-15,zuveg101,zuverge01
20356,zwilldu01,1888.0,11.0,2.0,USA,MO,St. Louis,1978.0,3.0,27.0,...,Zwilling,Edward Harrison,160.0,66.0,L,L,1910-08-14,1916-07-12,zwild101,zwilldu01
20357,zychto01,1990.0,8.0,7.0,USA,IL,Monee,NaN,NaN,NaN,...,Zych,Anthony Aaron,190.0,75.0,R,R,2015-09-04,2017-08-19,zycht001,zychto01

- We will cover Pandas and other things during the semester, and you have already had some exposure.

In [18]:
people_df.dtypes

playerID         object
birthYear       float64
birthMonth      float64
birthDay        float64
birthCountry     object
birthState       object
birthCity        object
deathYear       float64
deathMonth      float64
deathDay        float64
deathCountry     object
deathState       object
deathCity        object
nameFirst        object
nameLast         object
nameGiven        object
weight          float64
height          float64
bats             object
throws           object
debut            object
finalGame        object
retroID          object
bbrefID          object
dtype: object

In [19]:
from sqlalchemy import create_engine

In [20]:
engine = create_engine('mysql+pymysql://dbuser:dbuserdbuser@localhost')

In [21]:
people_df.to_sql('people', con=engine, schema='aaaaaaS22W4111Examples', index=False, if_exists='replace')

In [22]:
%sql use aaaaaaS22W4111Examples

 * mysql+pymysql://dbuser:***@localhost
0 rows affected.

[]

In [23]:
%sql describe people

 * mysql+pymysql://dbuser:***@localhost
24 rows affected.

[('playerID', 'text', 'YES', '', None, ''),
 ('birthYear', 'double', 'YES', '', None, ''),
 ('birthMonth', 'double', 'YES', '', None, ''),
 ('birthDay', 'double', 'YES', '', None, ''),
 ('birthCountry', 'text', 'YES', '', None, ''),
 ('birthState', 'text', 'YES', '', None, ''),
 ('birthCity', 'text', 'YES', '', None, ''),
 ('deathYear', 'double', 'YES', '', None, ''),
 ('deathMonth', 'double', 'YES', '', None, ''),
 ('deathDay', 'double', 'YES', '', None, ''),
 ('deathCountry', 'text', 'YES', '', None, ''),
 ('deathState', 'text', 'YES', '', None, ''),
 ('deathCity', 'text', 'YES', '', None, ''),
 ('nameFirst', 'text', 'YES', '', None, ''),
 ('nameLast', 'text', 'YES', '', None, ''),
 ('nameGiven', 'text', 'YES', '', None, ''),
 ('weight', 'double', 'YES', '', None, ''),
 ('height', 'double', 'YES', '', None, ''),
 ('bats', 'text', 'YES', '', None, ''),
 ('throws', 'text', 'YES', '', None, ''),
 ('debut', 'text', 'YES', '', None, ''),
 ('finalGame', 'text', 'YES', '', None, ''),
 ('retroID', 'text', 'YES', '', None, ''),
 ('bbrefID', 'text', 'YES', '', None, '')]

- CSV files are untyped. Every column is either a number or text. So, writing to the database results in untyped columns.


- Let's look at ```debut``` and ```finalGame.```

In [24]:
%sql select playerID, debut, finalGame from people limit 10

 * mysql+pymysql://dbuser:***@localhost
10 rows affected.

[('aardsda01', '2004-04-06', '2015-08-23'),
 ('aaronha01', '1954-04-13', '1976-10-03'),
 ('aaronto01', '1962-04-10', '1971-09-26'),
 ('aasedo01', '1977-07-26', '1990-10-03'),
 ('abadan01', '2001-09-10', '2006-04-13'),
 ('abadfe01', '2010-07-28', '2021-10-01'),
 ('abadijo01', '1875-04-26', '1875-06-10'),
 ('abbated01', '1897-09-04', '1910-09-15'),
 ('abbeybe01', '1892-06-14', '1896-09-23'),
 ('abbeych01', '1893-08-16', '1897-08-19')]

- What happens if I try to get the different between dates?

In [25]:
%sql select playerID, debut, finalGame, finalGame-debut from people limit 10

 * mysql+pymysql://dbuser:***@localhost
10 rows affected.

[('aardsda01', '2004-04-06', '2015-08-23', 11.0),
 ('aaronha01', '1954-04-13', '1976-10-03', 22.0),
 ('aaronto01', '1962-04-10', '1971-09-26', 9.0),
 ('aasedo01', '1977-07-26', '1990-10-03', 13.0),
 ('abadan01', '2001-09-10', '2006-04-13', 5.0),
 ('abadfe01', '2010-07-28', '2021-10-01', 11.0),
 ('abadijo01', '1875-04-26', '1875-06-10', 0.0),
 ('abbated01', '1897-09-04', '1910-09-15', 13.0),
 ('abbeybe01', '1892-06-14', '1896-09-23', 4.0),
 ('abbeych01', '1893-08-16', '1897-08-19', 4.0)]

- That looks sort of correct. What happens if I use some of the time or date functions?

In [26]:
%sql select playerID, debut, finalGame, datediff(finalGame, debut) as career_in_days from people limit 10

 * mysql+pymysql://dbuser:***@localhost
10 rows affected.

[('aardsda01', '2004-04-06', '2015-08-23', 4156),
 ('aaronha01', '1954-04-13', '1976-10-03', 8209),
 ('aaronto01', '1962-04-10', '1971-09-26', 3456),
 ('aasedo01', '1977-07-26', '1990-10-03', 4817),
 ('abadan01', '2001-09-10', '2006-04-13', 1676),
 ('abadfe01', '2010-07-28', '2021-10-01', 4083),
 ('abadijo01', '1875-04-26', '1875-06-10', 45),
 ('abbated01', '1897-09-04', '1910-09-15', 4758),
 ('abbeybe01', '1892-06-14', '1896-09-23', 1562),
 ('abbeych01', '1893-08-16', '1897-08-19', 1464)]

- How is MySQL doing this for dates if the value is ```TEXT```?


- The same way that it can do ...

In [27]:
%sql select '55' + '5'

 * mysql+pymysql://dbuser:***@localhost
1 rows affected.

[(60.0,)]

- How does Python handle this?

In [28]:
'55' + '5'

'555'

- In some cases, based on the function or operator, MySQL "guesses" the intended data type and does implicit type conversion (https://dev.mysql.com/doc/refman/8.0/en/type-conversion.html).


- This can act _weird_ some time times.

In [29]:
%sql select '444' + '5'

 * mysql+pymysql://dbuser:***@localhost
1 rows affected.

[(449.0,)]

In [31]:
%sql select '444' > '5'

 * mysql+pymysql://dbuser:***@localhost
1 rows affected.

[(0,)]

- In this example,
    - '+' cause a conversion to numbers.
    - '>' is valid for string, and the engine uses sort order for string.

- So, when doing operations with columns, you can hope the conversion works, but ... <br><br>
__Luck is not a plan.__


- There are type conversation conversion operators and functions.

In [32]:
%sql select playerID, debut, CAST(debut AS DATE) as debut_date from people limit 10;

 * mysql+pymysql://dbuser:***@localhost
10 rows affected.

[('aardsda01', '2004-04-06', datetime.date(2004, 4, 6)),
 ('aaronha01', '1954-04-13', datetime.date(1954, 4, 13)),
 ('aaronto01', '1962-04-10', datetime.date(1962, 4, 10)),
 ('aasedo01', '1977-07-26', datetime.date(1977, 7, 26)),
 ('abadan01', '2001-09-10', datetime.date(2001, 9, 10)),
 ('abadfe01', '2010-07-28', datetime.date(2010, 7, 28)),
 ('abadijo01', '1875-04-26', datetime.date(1875, 4, 26)),
 ('abbated01', '1897-09-04', datetime.date(1897, 9, 4)),
 ('abbeybe01', '1892-06-14', datetime.date(1892, 6, 14)),
 ('abbeych01', '1893-08-16', datetime.date(1893, 8, 16))]

- Keeping the underlying column as a ```TEXT``` is a bad idea.

In [33]:
%sql update people set debut='cat' where playerID='aardsda01'

 * mysql+pymysql://dbuser:***@localhost
1 rows affected.

[]

In [34]:
%sql select playerID, debut, finalGame, finalGame-debut from people limit 10

 * mysql+pymysql://dbuser:***@localhost
10 rows affected.

[('aardsda01', 'cat', '2015-08-23', 2015.0),
 ('aaronha01', '1954-04-13', '1976-10-03', 22.0),
 ('aaronto01', '1962-04-10', '1971-09-26', 9.0),
 ('aasedo01', '1977-07-26', '1990-10-03', 13.0),
 ('abadan01', '2001-09-10', '2006-04-13', 5.0),
 ('abadfe01', '2010-07-28', '2021-10-01', 11.0),
 ('abadijo01', '1875-04-26', '1875-06-10', 0.0),
 ('abbated01', '1897-09-04', '1910-09-15', 13.0),
 ('abbeybe01', '1892-06-14', '1896-09-23', 4.0),
 ('abbeych01', '1893-08-16', '1897-08-19', 4.0)]

- That was totally weird. First, let's undo my change.

In [35]:
%sql update people set debut='2004-04-06' where playerID='aardsda01'

 * mysql+pymysql://dbuser:***@localhost
1 rows affected.

[]

- Let's look at some other stuff.

In [37]:
%sql select playerID, birthYear, birthMonth, birthDay from people limit 10;

 * mysql+pymysql://dbuser:***@localhost
10 rows affected.

[('aardsda01', 1981.0, 12.0, 27.0),
 ('aaronha01', 1934.0, 2.0, 5.0),
 ('aaronto01', 1939.0, 8.0, 5.0),
 ('aasedo01', 1954.0, 9.0, 8.0),
 ('abadan01', 1972.0, 8.0, 25.0),
 ('abadfe01', 1985.0, 12.0, 17.0),
 ('abadijo01', 1850.0, 11.0, 4.0),
 ('abbated01', 1877.0, 4.0, 15.0),
 ('abbeybe01', 1869.0, 11.0, 11.0),
 ('abbeych01', 1866.0, 10.0, 14.0)]

- Well, that is a bit awkward. This is not uncommon when importing untyped data. Getting types correct relies on luck and __Luck is not a plan.__


- I would like to make this into a date.

In [38]:
%%sql 

select
        playerID, birthYear, birthMonth, birthDay, 
        STR_TO_DATE(
            CONCAT(
					if (birthYear is NULL, NULL, birthYear),'-',
                   if (birthMonth is NULL, NULL, LPAD(birthMonth,2,'00')),'-',
                   LPAD(birthDay,2,'00')),
        '%Y-%m-%d') 
			   as fixed_dob
        from people 
        where birthYear is not NULL and birthDay is NULL
        order by birthYear limit 10;

 * mysql+pymysql://dbuser:***@localhost
10 rows affected.

[('popplge01', 1840.0, 8.0, None, None),
 ('brainas01', 1841.0, None, None, None),
 ('studlse01', 1841.0, 5.0, None, None),
 ('swandma01', 1841.0, 7.0, None, None),
 ('addybo01', 1842.0, 2.0, None, None),
 ('galvijo01', 1842.0, 8.0, None, None),
 ('byrnech99', 1843.0, 9.0, None, None),
 ('scanlmi99', 1843.0, 11.0, None, None),
 ('austihe01', 1844.0, 10.0, None, None),
 ('coughde01', 1844.0, 1.0, None, None)]

- If we do not know the day or month (or year), then we do not know the DOB and is must be ```NULL```.


- Who do we know is "dead," exactly the day they died and lived the longest?

In [39]:
%%sql 

with compute_age_1 as
    (
        select
            playerID, nameLast, nameFirst,
            birthYear, birthMonth, birthDay, 
            deathYear, deathMonth, deathDay,
            STR_TO_DATE(
                CONCAT(
                        if (birthYear is NULL, NULL, birthYear),'-',
                       if (birthMonth is NULL, NULL, LPAD(birthMonth,2,'00')),'-',
                       if (birthDay is NULL, NULL, LPAD(birthDay,2,'00'))),
            '%Y-%m-%d') 
                   as fixed_dob,
            STR_TO_DATE(
                CONCAT(
                        if (deathYear is NULL, NULL, deathYear),'-',
                       if (deathMonth is NULL, NULL, LPAD(deathMonth,2,'00')),'-',
                       if (deathDay is NULL, NULL, LPAD(deathDay,2,'00'))),
            '%Y-%m-%d') 
                   as fixed_dod
            from people
    )
select playerID, nameLast, nameFirst, datediff(fixed_dod, fixed_dob) as life_in_days
    from compute_age_1
    order by life_in_days desc
    limit 10;

 * mysql+pymysql://dbuser:***@localhost
10 rows affected.

[('hoffch01', 'Hoff', 'Red', 39213),
 ('marreco01', 'Marrero', 'Connie', 37619),
 ('wrighbo01', 'Wright', 'Bob', 37119),
 ('parkeac01', 'Parker', 'Ace', 37063),
 ('malinto01', 'Malinosky', 'Tony', 37014),
 ('swanska01', 'Swanson', 'Karl', 36997),
 ('daleyjo01', 'Daley', 'John', 36988),
 ('otisbi01', 'Otis', 'Bill', 36880),
 ('robined01', 'Robinson', 'Eddie', 36818),
 ('stilero01', 'Stiles', 'Rollie', 36772)]

- How can I be sure?

In [40]:
from IPython.display import IFrame
from IPython.core.display import display

display(IFrame('https://en.wikipedia.org/wiki/Red_Hoff', '100%', '600px'))